{"meta":{"title":"Jia's Blog","subtitle":"其实地上本没有路，走的人多了，也便成了路。","description":"这是属于我自己的个人博客～记录学习与生活","author":"Jia Du","url":"https://Toddlike.github.io","root":"/"},"pages":[{"title":"404","date":"2019-07-12T05:41:20.760Z","updated":"2019-06-04T12:12:08.052Z","comments":true,"path":"404.html","permalink":"https://Toddlike.github.io/404.html","excerpt":"","text":"404 Not Found **很抱歉，您访问的页面不存在** 可能是输入的地址有误或者该地址已被删除"},{"title":"archive","date":"2019-06-04T12:38:12.000Z","updated":"2019-06-04T12:38:12.380Z","comments":true,"path":"archives/index.html","permalink":"https://Toddlike.github.io/archives/index.html","excerpt":"","text":""},{"title":"关于我以及我的博客","date":"2019-07-14T14:15:00.199Z","updated":"2019-07-14T14:15:00.199Z","comments":true,"path":"about/index.html","permalink":"https://Toddlike.github.io/about/index.html","excerpt":"","text":"嗯嗯嗯嗯还没想好怎么写大概也就一条咸鱼吧～"},{"title":"分类","date":"2019-07-12T05:41:20.760Z","updated":"2019-06-04T12:04:50.478Z","comments":true,"path":"categories/index.html","permalink":"https://Toddlike.github.io/categories/index.html","excerpt":"","text":""},{"title":"我的朋友们","date":"2019-07-15T03:49:17.744Z","updated":"2019-07-15T03:49:17.738Z","comments":true,"path":"friends/index.html","permalink":"https://Toddlike.github.io/friends/index.html","excerpt":"","text":"你也可以在下方留下你的博客或者个人网站链接啊，留下格式：名称: Jia’s Blog网址: https://toddlike.github.io头像: https://img.vim-cn.com/6a/7e3c5d09f2cb48f97db7028a068635be6b2d24.jpg标签: -标签1 -标签2～咱们江湖再会！"},{"title":"","date":"2019-07-12T05:41:20.759Z","updated":"2019-06-04T12:21:02.174Z","comments":true,"path":"mylist/index.html","permalink":"https://Toddlike.github.io/mylist/index.html","excerpt":"","text":""},{"title":"游戏","date":"2019-07-14T03:36:25.000Z","updated":"2019-07-15T03:41:48.604Z","comments":true,"path":"game/index.html","permalink":"https://Toddlike.github.io/game/index.html","excerpt":"","text":""},{"title":"标签","date":"2019-07-12T05:41:20.760Z","updated":"2019-06-04T12:05:28.690Z","comments":true,"path":"tags/index.html","permalink":"https://Toddlike.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Electricity and Magnetism","slug":"Magnetism","date":"2019-07-15T07:38:22.000Z","updated":"2019-07-16T11:54:35.432Z","comments":true,"path":"2019/07/15/Magnetism/","link":"","permalink":"https://Toddlike.github.io/2019/07/15/Magnetism/","excerpt":"What holds our world together?As most of us had be crystal clear on this fact that the world is made up of atoms, the question we are actually asking is what is holding those atoms together.","text":"What holds our world together?As most of us had be crystal clear on this fact that the world is made up of atoms, the question we are actually asking is what is holding those atoms together. Well, what is holding them together are the nuclear forces, which we do not fully understand. So in other words, on nuclear scale $10^{-14}$ meters, very important are the nuclear forces; on an atomic scale up to thousands of kilmeters, it’s really electric forces that hold our world together. But on much larger scale, planets and the galaxy, it is gravity that holds our world together. Positive and negative chargesThe brief historyAlready in 600 hundred BC, it was known that if you rub amber that it can attract pieces of dry leaves. And the Greek word for amber is electron, so that’s where electricity got its name from. In the 16 centuries there were more substances known to do this. For instance glass and sulfur. It was also konwn and written that when people were bored at parties that the women would rub their amber jewelry and would touch frogs which then would start jumping of desperation, which people considered to be fun, not understanding what was actually happening to the amber nor what was happening to the frogs. In the 18 centuries it was discovered that there are two types of electricity: One if you rub glass and another if you rub rubber or amber for that matter, due to Benjamin Frankin without any knowledge of electrons and protonsw who introduced the idea that all substances are penetrated with what he called electric fluid, electric fire. And he stated it if you get too much of the fire the you’re positively charged and if you have a deficiency of that fire the you’re negatively charged. He introduced the sign convention and he decided that if you rub glass that is an excess of fire and be called that therefore positive. (You will see later why this choice, he had fifty percent chance, is extremely unfortunate but we have to live with it.) You cannot create charge, if you create plus then automatically create mius. Plus and plus repel each other, minus and minus repel each other. And plus and minus attract. Forces-Coulomb’s lawIf we take two charges and we use in general for charge the symbol Q. And Coulomb, the French physicist, who did a lot of research on this in the 18th~19th centuries actually. In the SI units we will use for the unit of charge the coulomb named after this great man. One coulomb charge is a horrendous amount if charge! More than you ever see in your life time. So let’s see the Coulombs’s Law, the force on charge number two due to one : $$\\vec{F_{1,2}}=\\frac{KQ_1Q_2}{r^2}\\hat{r}_{1,2}$$ And the coulomb’s constant $K$ in SI units is $9\\times10^9 $ $ N·m^2/c^2$, (for historical reasons, the $K$ is also equals $\\frac{1}{4\\pi\\epsilon_0}$, this $\\epsilon_0$ called the permittivity of free space), the $\\hat{r}_{1,2}$ is the unit vector from 1 to 2. The charge of one proton, which is exactly the same as the charge of one electron, is approximately $1.6\\times 10^{-19}$ C. The Coulomb Force and the GravityCompare them by computingNotice that there is a clear parallel with gravity. Newton’s law of gravity: $\\vec{F_{1,2}}= - \\frac{GM_1M_2}{r^2}\\hat{r}_{1,2}$ $G=6.67259\\times 10^{-11}$ $ N·m²/kg²$ is the gravitational constant. Comparing electricity with gravity, you’ll see that electric forces are way more powerful than gravitational forces Let’s caculate the magnitude of the forces by taking two protons, which are seperated by a distance $d$. $F_{e}=\\frac{KQQ}{d^2}=\\frac{9 \\times 10^9 \\times (1.6\\times 10^{-19})^2}{d^2}$ $F_g=\\frac{Gmm}{d^2}=\\frac{6.67 \\times 10^{-11}\\times(1.7\\times 10^{-27})^2}{d^2}$ $\\frac{F_e}{F_g}\\approx36$ So the electric force is 36 orders of magnitude more potent than the gravitational attraction! The nuclear forcesThe nucleus has a size of about $10^{-14}$ meters, and the atom itself is about ten thousand times larger. The cloud of electrons which is about $10^{-10}$ meters. Let’s think about $a_p=\\frac{F_{electricity}}{M_P}$ If you make $d=10^{-14} $ $m^2$, and you calculate the ratio you will find it is 26 orders of magnitude higher than the graviton acceleration on the earth. So you wonder what the hell holds the nucleus together. If there is such a tremendous force on these protons. Well thats nuclear forces, which we do not fully understand yet. The PolarizationsConductors have a small fraction of their electrons which are not bound to atoms but which we can freely move around in the conductor. That’s a characteristic for a conductor, for metals. While that’s not the case with nonconductors there the all electrons are fixed to individual atoms. The electrons want to be attracted by positive charges. When you use a conductor approaching positive charges, some of (very subtle) these electrons will move to the closer side to the positive charges. Then the closer side is negative and the other side is positive. This process we call induction. It’s sort of a polarization. And by the way, in the nonconductors’ cases, the things described above are still the same, but much more subtle. Keywords of this article : Electric charges , Forces-Coulomb’s law and Polarizations","categories":[{"name":"学习","slug":"学习","permalink":"https://Toddlike.github.io/categories/学习/"},{"name":"笔记","slug":"学习/笔记","permalink":"https://Toddlike.github.io/categories/学习/笔记/"}],"tags":[{"name":"Physics","slug":"Physics","permalink":"https://Toddlike.github.io/tags/Physics/"},{"name":"电磁学","slug":"电磁学","permalink":"https://Toddlike.github.io/tags/电磁学/"}]},{"title":"$\\LaTeX$学习","slug":"LaTeX-Learning-md","date":"2019-07-15T07:24:22.000Z","updated":"2019-07-15T07:46:53.055Z","comments":true,"path":"2019/07/15/LaTeX-Learning-md/","link":"","permalink":"https://Toddlike.github.io/2019/07/15/LaTeX-Learning-md/","excerpt":"","text":"","categories":[{"name":"学习","slug":"学习","permalink":"https://Toddlike.github.io/categories/学习/"},{"name":"笔记","slug":"学习/笔记","permalink":"https://Toddlike.github.io/categories/学习/笔记/"}],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://Toddlike.github.io/tags/笔记/"},{"name":"总结","slug":"总结","permalink":"https://Toddlike.github.io/tags/总结/"}]},{"title":"Hello World !","slug":"hello-world","date":"2019-05-26T06:21:06.717Z","updated":"2019-06-06T04:44:51.733Z","comments":true,"path":"2019/05/26/hello-world/","link":"","permalink":"https://Toddlike.github.io/2019/05/26/hello-world/","excerpt":"似乎任何与代码相关的东西都离不开 Hello World ！这句神奇咒语，于是我便借此作为本篇标题，寓意是啥我也不知道。","text":"似乎任何与代码相关的东西都离不开 Hello World ！这句神奇咒语，于是我便借此作为本篇标题，寓意是啥我也不知道。 很高兴你能来到我的个人博客! 这是我的个人博客，可以看出这是基于GitHub Pages和 Hexo的静态网页的博客（没啥技术含量，但是愚蠢的DJ到现在还没完全搞明白其中的种种），搭建这个博客的时候遇到了不少莫名其妙的问题，大多也被我莫名其妙地解决了-/0-0/！～ 从最初的搞定一直网页404，到最后搭建完成还是略有所获。我希望能写下并总结一些学习生活上的种种，我想完全是可以代替日记本的。目前没啥文字，没想着去租一个好看好记的域名，页面也还有不足，这只是个开始，就像法拉第[Faraday]曾经驳斥过：“一个刚出生的婴儿又有什么用呢？” 于是这就成了我的第一篇Blog起因搭建这个博客我是没有细想过的，直到运动会期间我的好友给了我这个idea，我觉得可还行，试着就做了（没事喜欢折腾，但实在也没啥技术含量） 作用我的个人博客我想把它用于学习，记录，分享。这博客能写出文字，代码，还能渲染出公式（LaTeX），还有点音乐（虽然有不足ಠ_ಠ）等，可以干的东西应该不少。这类博客网上也不少，应该还是能有所获。 不足现在这个博客还没达到我心里想要的效果，比如背景图还没有选（没找到合适的壁纸），网易云的音乐插件只能在一个页面播放（不支持全局播放，毕竟是静态网页，估计是没办法解决了），主题还是依靠别人写的框架（日后我再研究研究自己写吧），最重要的是，还没啥文字在里面。 待做日后我等我把东西写多了（估计也会和朋友一起写），应该会去找马云dad租个域名，日后说不定也会加上评论功能（点赞就算了。。），可以看出这篇文章还没有图片，因为我还没学会如何批量上传图床并恰当应用，日后解决。","categories":[{"name":"记录","slug":"记录","permalink":"https://Toddlike.github.io/categories/记录/"}],"tags":[{"name":"My Blog","slug":"My-Blog","permalink":"https://Toddlike.github.io/tags/My-Blog/"}]}]}